---
kind: property
id: P:Autodesk.Revit.DB.FamilyInstance.ToRoom(Autodesk.Revit.DB.Phase)
zh: 族实例
source: html/94e34f74-b6d1-2e4b-df44-b93aac5543c6.htm
---
# Autodesk.Revit.DB.FamilyInstance.ToRoom Property

**中文**: 族实例

## Syntax (C#)
```csharp
public Room this[
	Phase phase
] { get; }
```

## Parameters
- **phase** (`Autodesk.Revit.DB.Phase`)